## Calculate Special Bonus Leetcode Task6

In [1]:
import pandas as pd
import numpy as np

In [45]:
data = [[2, 'Meir', 3000], [3, 'Michael', 3800], [7, 'Addilyn', 7400], [8, 'Juan', 6100], [9, 'Kannon', 7700]]
Employees = pd.DataFrame(data, columns=['employee_id', 'name', 'salary']).astype({'employee_id':'int64', 'name':'object', 'salary':'int64'})

In [46]:
Employees

   employee_id     name  salary
0            2     Meir    3000
1            3  Michael    3800
2            7  Addilyn    7400
3            8     Juan    6100
4            9   Kannon    7700

In [54]:
Employees['bouns']=0
Employees.loc[(Employees['employee_id'] % 2 == 1) & (Employees['name'].str[0] != 'M'), 'bouns'] = Employees['salary']

In [60]:
Employees[['employee_id','bouns']].sort_values(by='employee_id')

   employee_id  bouns
0            2      0
1            3      0
2            7   7400
3            8      0
4            9   7700